import React from 'react';
import Textarea from '@/components/commons/Textarea';

export default {
  title: 'Textarea',
  component: Textarea,
};

const longText = `이상을 가진 얼음이 실로 청춘이 가지에 끝에 보라. 천하를 것이다.보라, 피부가 관현악이며, 따뜻한 청춘이 가치를 눈이 것이다. 청춘은 끓는 구하지 있는 찬미를 이성은 봄바람이다. 아니더면, 행복스럽고 같으며, 이것을 것이다. 귀는 설산에서 살 기관과 몸이 말이다. 꽃 내려온 트고, 철환하였는가? 인간은 고행을 웅대한 곧 보는 그들의 크고 못할 천하를 피다. 따뜻한 고동을 밝은 있으랴? 피부가 반짝이는 위하여 어디 있는 사랑의 작고 기관과 그리하였는가?

청춘의 행복스럽고 관현악이며, 찾아다녀도, 이것이다. 이것이야말로 있음으로써 이상, 긴지라 무엇이 운다. 설레는 찾아다녀도, 투명하되 같은 교향악이다. 인생에 불어 내는 얼마나 보배를 가치를 인생에 많이 있으랴? 그들의 착목한는 넣는 살았으며, 우리는 보배를 무엇을 과실이 만물은 아름다우냐? 사랑의 지혜는 우리 능히 소금이라 이것은 피다. 꽃이 피어나기 갑 청춘은 소금이라 장식하는 피고 약동하다. 곧 것은 사라지지 인간은 싸인 부패뿐이다. 위하여, 천하를 같으며, 봄바람이다. 구하지 그들을 커다란 꾸며 인간이 하는 것이다.

놀이 듣기만 눈이 싶이 뭇 것이 부패뿐이다. 못하다 구하기 풍부하게 하여도 생명을 내는 운다. 풍부하게 얼음과 두손을 힘차게 청춘의 따뜻한 봄바람이다. 들어 노년에게서 내는 넣는 것이다.보라, 뭇 인생의 영원히 품으며, 있는가? 공자는 방황하여도, 얼마나 이상 사막이다. 우리의 예수는 우리 청춘 청춘의 너의 남는 그들의 있으랴? 너의 부패를 끓는 이상의 우리의 끝에 새 무엇이 봄바람이다. 원대하고, 얼마나 위하여, 굳세게 곳으로 그리하였는가? 타오르고 돋고, 실현에 가슴에 피어나는 따뜻한 구하기 커다란 뜨고, 봄바람이다. 모래뿐일 불어 위하여, 무엇을 위하여 몸이 우는 아름답고 이것을 피다.

풀밭에 대중을 아름답고 더운지라 원대하고, 꽃 되는 일월과 위하여서 것이다. 못할 우리 목숨이 이 인간에 간에 그들은 행복스럽고 두손을 피다. 속에서 모래뿐일 있음으로써 아름답고 희망의 인생을 유소년에게서 때문이다. 시들어 품고 곳으로 봄바람을 속에 물방아 바이며, 가진 끓는다. 길을 얼마나 고행을 이것이다. 두손을 피어나는 광야에서 피어나기 이것이다. 자신과 사람은 얼음 이상의 보라. 고행을 든 얼음 아니한 봄바람이다. 하는 인간에 하여도 있으랴?

찬미를 아름답고 위하여서 생의 전인 만물은 교향악이다. 있는 만천하의 들어 인간에 가치를 위하여서, 돋고, 것이다. 긴지라 군영과 역사를 같으며, 있는 피부가 많이 그들은 할지라도 쓸쓸하랴? 그들의 이는 소금이라 인간이 불러 할지라도 칼이다. 대중을 보배를 되는 할지라도 그리하였는가? 위하여서 동산에는 만천하의 풀이 할지라도 이상이 것이 너의 그들을 있으랴? 못할 넣는 가치를 없으면, 청춘을 열락의 생생하며, 쓸쓸하랴? 그것을 기관과 어디 것은 희망의 무엇을 인간의 이것이다. 가는 이는 황금시대의 목숨이 노년에게서 것이다. 얼음이 피가 오직 듣기만 놀이 가지에 듣는다. 피에 사는가 군영과 역사를 것은 봄날의 구하지 속잎나고, 크고 아니다.

사랑의 보배를 풀밭에 것이다. 때까지 같이, 수 보라. 가지에 같이, 우리 우리 대중을 사는가 부패뿐이다. 청춘에서만 뜨거운지라, 그러므로 곧 얼음과 주는 없으면, 끓는 구할 보라. 원질이 시들어 가치를 크고 바로 피가 따뜻한 군영과 것이다. 할지니, 보배를 광야에서 이것이다. 수 놀이 없는 생의 커다란 이상의 안고, 불러 있을 보라. 있는 거친 인생에 아니다. 두손을 그들은 만천하의 그들에게 너의 찾아 그것은 품었기 쓸쓸하랴? 불어 얼마나 힘차게 무한한 같은 교향악이다.`;

export const Default = () => <Textarea />;
export const InValue = () => <Textarea text="테스트를 위한 값" />;
export const InPlaceholder = () => (
  <Textarea placeholder="테스트를 위해 값을 입력해 주세요." />
);
export const TestText = () => (
  <Textarea text={longText} placeholder="테스트를 위해 값을 입력해 주세요." />
);
